# 1.    Ви - злий касир в АТБ і продаєте алкогольні напої 
# лише особам старше 18 років. Людям, старше 14 років і 
# молодше 18 років, ви продаєте лише енергетичні напої. 
# Всім решта - лише Живчик:).
# Напишіть функціонал на пайтоні, який реалізує цей алгоритм.

age = 11

if age >= 18:
    print("\n"*2)
    print("Ми можемо продати вам алкогольні напої")
elif age >= 14 and age < 18:
    print("\n"*2)
    print("Ми не можемо продати алкоголь, але можемо продати енергетики")
else:
    print("\n"*2)
    print("Вам можна лише Живчик")


# 2.    Ви працюєте на проекті, який займається тим, що 
# опрацьовує дані по платежах клієнтів від різних 
# платіжних систем. Дані зберігаються в csv-файлах 
# на Linux сервері. При перекидуванні даних на 
# Windows сервер виявилось, що віндовс додає специфічні 
# символи на позначення початку (“;”) і закінчення стрічки
# (“%”) з зашифрованим Transaction ID (було “yu7i9om0iymn”, 
# стало “;yu7i9om0iymn%“). Це критичний баг для проекту. 
# Реалізуйте механізм на пайтоні, який буде видаляти непотрібні 
# символи з початку і кінця Transaction ID.

transaction_id = ";yu7i9om0iymn%"

print("\n"*2)
print(transaction_id[0], transaction_id[-1])

print(len(transaction_id))

print(transaction_id[1:13])